Revit 2024 API
BuiltInFailures.SketchFailures.SculptingCurvesCrossAxis Property
 The highlighted curves cross the axis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SculptingCurvesCrossAxis { get; }
Visual Basic
Public Shared ReadOnly Property SculptingCurvesCrossAxis As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SculptingCurvesCrossAxis {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace